tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "s-newman/tap", "github:s-newman/homebrew-tap.git"
brew "age"
brew "zstd"
brew "coreutils"
brew "curl"
brew "dua-cli"
brew "fd"
brew "fzf"
brew "gnu-sed"
brew "gnupg"
brew "gnuplot"
brew "graphviz"
brew "htop"
brew "hyperfine"
brew "jq"
brew "libgit2"
brew "neofetch"
brew "nmap"
brew "node"
brew "openjdk"
brew "pandoc"
brew "python@3.12"
brew "pipx"
brew "powerlevel10k"
brew "python@3.10"
brew "python@3.11"
brew "python@3.8"
brew "python@3.9"
brew "ripgrep"
brew "shellcheck"
brew "terraform"
brew "tokei"
brew "transmission-cli"
brew "tree"
brew "vim"
brew "virtualenvwrapper"
brew "watch"
brew "wget"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "s-newman/tap/sshpass"
cask "android-platform-tools"
cask "bartender"
cask "discord"
cask "drawio"
cask "font-caskaydia-cove-nerd-font"
cask "gimp"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-earth-pro"
cask "istat-menus"
cask "iterm2"
cask "rectangle-pro"
cask "spotify"
cask "via"
cask "viscosity"
cask "visual-studio-code"
cask "wireshark"
cask "zoom"
vscode "4ops.terraform"
vscode "alefragnani.project-manager"
vscode "eamodio.gitlens"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.hcl"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.wordcount"
vscode "nhoizey.gremlins"
vscode "njpwerner.autodocstring"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "ryanluker.vscode-coverage-gutters"
vscode "stkb.rewrap"
vscode "tamasfe.even-better-toml"
vscode "teabyii.ayu"
vscode "timonwong.shellcheck"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "voldemortensen.rainbow-tags"
vscode "vscodevim.vim"
vscode "yzhang.markdown-all-in-one"
